"""
Агенты для системы планирования: планировщик и критик.
"""
import sys
from pathlib import Path

sys.path.insert(0, str(Path(__file__).parent.parent))

from main.journey_llm import JourneyLLM
from planning.models import (
    GraphState, Reasoning, Plan, Critique
)
from planning.tools import get_all_tools


class PlannerAgent:
    """Агент планировщик."""
    
    def __init__(self, llm: JourneyLLM):
        self.llm = llm
        self.tools = get_all_tools()
        self.llm_with_tools = llm.llm.bind_tools(self.tools)
    
    
    def create_reasoning(self, state: GraphState) -> Reasoning:
        """Создать рассуждения перед планированием."""
        print("\n" + "="*60)
        print("🤔 ПЛАНИРОВЩИК: Начинаю анализ и рассуждения...")
        print("="*60)
        print(f"Анализирую {len(state.input_data.events)} событий")
        
        events_str = "\n".join([
            f"- {e.name} ({e.address}, {e.duration_minutes} мин, приоритет: {e.priority}, обязательное: {e.required})"
            for e in state.input_data.events
        ])
        
        constraints_str = f"""
Ограничения:
- Время начала: {state.input_data.constraints.start_time or 'не указано'}
- Время окончания: {state.input_data.constraints.end_time or 'не указано'}
- Максимальное время: {state.input_data.constraints.max_total_time_minutes or 'не указано'} минут
- Предпочтительный транспорт: {state.input_data.constraints.preferred_transport or 'не указано'}
- Бюджет: {state.input_data.constraints.budget or 'не указано'}
- Другие ограничения: {', '.join(state.input_data.constraints.other_constraints) or 'нет'}
"""
        
        system_prompt = """Ты опытный планировщик маршрутов и походов. 
Твоя задача - проанализировать доступные события и ограничения, чтобы подготовиться к созданию оптимального плана.

Сначала проанализируй ситуацию, выяви важные соображения, возможные проблемы и определи стратегию планирования.
Используй доступные инструменты для получения дополнительной информации (погода, маршруты, информация из интернета), если это необходимо.

При планировании учитывай выбор транспорта:
- Для коротких расстояний (< 10 минут пешком) - walking
- Для длинных расстояний (> 10 минут пешком) - bus или car (выбирай оптимальный)

Доступные инструменты:
- get_route_info: получить информацию о маршруте между двумя адресами (возвращает время для walking, bus, car)
- get_weather_by_address: получить погоду по адресу
- search_web: поиск информации в интернете"""

        user_prompt = f"""Пользователь хочет создать план похода со следующими событиями:

{events_str}

{constraints_str}

Промпт пользователя: {state.input_data.user_prompt}

Проанализируй ситуацию и подготовь рассуждения перед созданием плана. 
Используй инструменты для получения дополнительной информации, если нужно."""

        print("Отправляю запрос к LLM для анализа...")
        print("💡 LLM может использовать инструменты для получения дополнительной информации")
        # Получаем рассуждения через parse с инструментами
        reasoning = self.llm.parse(
            Reasoning,
            user_prompt=user_prompt,
            system_prompt=system_prompt,
            tools=self.tools
        )
        
        print("✅ Рассуждения получены:")
        print(f"   - Соображений: {len(reasoning.considerations)}")
        print(f"   - Проблем выявлено: {len(reasoning.challenges)}")
        print(f"   - Стратегия: {reasoning.strategy[:100]}..." if len(reasoning.strategy) > 100 else f"   - Стратегия: {reasoning.strategy}")
        
        return reasoning
    
    def create_plan(self, state: GraphState) -> Plan:
        """Создать план на основе событий и ограничений."""
        print("\n" + "="*60)
        print("📋 ПЛАНИРОВЩИК: Создаю план похода...")
        print("="*60)
        
        if state.reasoning:
            print("Использую предыдущие рассуждения")
        if state.critique:
            print("Учитываю критику предыдущего плана")
        
        # Используем информацию из состояния, если она есть
        # Иначе LLM соберет её через инструменты
        maps_info = state.maps_info if state.maps_info else {}
        weather_info = state.weather_info if state.weather_info else {}
        
        events_str = "\n".join([
            f"- {e.name} ({e.address}, {e.duration_minutes} мин, приоритет: {e.priority}, обязательное: {e.required})"
            for e in state.input_data.events
        ])
        
        constraints_str = f"""
Ограничения:
- Время начала: {state.input_data.constraints.start_time or 'не указано'}
- Время окончания: {state.input_data.constraints.end_time or 'не указано'}
- Максимальное время: {state.input_data.constraints.max_total_time_minutes or 'не указано'} минут
- Предпочтительный транспорт: {state.input_data.constraints.preferred_transport or 'не указано'}
- Бюджет: {state.input_data.constraints.budget or 'не указано'}
- Другие ограничения: {', '.join(state.input_data.constraints.other_constraints) or 'нет'}
"""
        
        reasoning_str = ""
        if state.reasoning:
            reasoning_str = f"""
Предыдущие рассуждения:
Анализ: {state.reasoning.analysis}
Соображения: {', '.join(state.reasoning.considerations)}
Проблемы: {', '.join(state.reasoning.challenges)}
Стратегия: {state.reasoning.strategy}
"""
        
        critique_str = ""
        if state.critique:
            critique_str = f"""
Критика предыдущего плана:
Общая оценка: {state.critique.overall_assessment}
Сильные стороны: {', '.join(state.critique.strengths)}
Слабые стороны: {', '.join(state.critique.weaknesses)}
Предложения: {', '.join(state.critique.suggestions)}
Критические проблемы: {', '.join(state.critique.critical_issues)}
"""
        
        # Форматируем информацию о погоде
        weather_info_str = ""
        if weather_info:
            weather_info_str = "\nИнформация о погоде:\n"
            for address, w_data in weather_info.items():
                if w_data.get("success"):
                    weather_info_str += f"- {address}: {w_data.get('description', 'N/A')}, температура: {w_data.get('temperature', 'N/A')}°C\n"
        
        # Форматируем информацию о маршрутах
        maps_info_str = ""
        if maps_info:
            maps_info_str = "\n📍 ВАЖНО: Информация о времени в пути между событиями:\n"
            maps_info_str += "СРАВНИВАЙ время для разных видов транспорта и выбирай оптимальный!\n"
            maps_info_str += "Рекомендация: если walking > 10 минут, используй bus или car (выбирай самый быстрый).\n\n"
            for route_key, route_data in maps_info.items():
                if route_data.get("success"):
                    modes = route_data.get("modes", {})
                    maps_info_str += f"Маршрут: {route_key}\n"
                    # Сортируем по времени в пути для удобства сравнения
                    sorted_modes = sorted(
                        modes.items(),
                        key=lambda x: x[1].get("duration_min", float('inf'))
                    )
                    for mode, mode_info in sorted_modes:
                        duration_min = mode_info.get("duration_min", 0)
                        distance_km = mode_info.get("distance_km", 0)
                        # Переводим минуты в часы и минуты для читаемости
                        hours = int(duration_min // 60)
                        minutes = int(duration_min % 60)
                        if hours > 0:
                            time_str = f"{hours}ч {minutes}мин"
                        else:
                            time_str = f"{minutes}мин"
                        # Добавляем пометку о рекомендуемости
                        recommendation = ""
                        if mode == "walking" and duration_min > 10:
                            recommendation = " ⚠️ (слишком долго, лучше использовать bus/car)"
                        elif mode == sorted_modes[0][0] and duration_min <= sorted_modes[0][1].get("duration_min", float('inf')):
                            recommendation = " ✅ (самый быстрый вариант)"
                        maps_info_str += f"  • {mode}: {time_str} ({distance_km:.2f} км){recommendation}\n"
                    maps_info_str += "\n"
        
        web_info_str = ""
        if state.web_info:
            web_info_str = f"\nИнформация из интернета: {state.web_info}\n"
        
        # Формируем инструкции о маршрутах
        route_instruction = ""
        if maps_info_str:
            route_instruction = """
КРИТИЧЕСКИ ВАЖНО: Используй точные данные о времени в пути из раздела ниже!
Для каждого перехода между событиями:
1. Сравни время в пути для всех видов транспорта (walking, bus, car)
2. Выбирай оптимальный транспорт:
   - Если walking < 10 минут → используй walking
   - Если walking > 10 минут → используй bus или car (выбирай самый быстрый)
3. Бери время в пути из предоставленных данных для выбранного транспорта, а не придумывай сам.
"""
        else:
            route_instruction = """
КРИТИЧЕСКИ ВАЖНО: Для получения точного времени в пути между событиями ОБЯЗАТЕЛЬНО используй инструмент get_route_info!
Инструмент вернет время для walking, bus и car - сравнивай их и выбирай оптимальный:
- Если walking < 10 минут → используй walking
- Если walking > 10 минут → используй bus или car (выбирай самый быстрый)
Не придумывай время в пути сам - всегда вызывай инструмент для каждой пары событий.
"""
        
        system_prompt = """Ты опытный планировщик маршрутов и походов. 
Твоя задача - создать оптимальный план похода, учитывая все события, ограничения и доступную информацию.

ВАЖНО: Используй точные данные о времени в пути между событиями! Если информация о маршрутах не предоставлена, используй инструменты для её получения.
План должен быть реалистичным, учитывать время в пути между событиями, погодные условия и другие факторы.
Если есть критика предыдущего плана, обязательно учти её при создании нового плана.

ВЫБОР ТРАНСПОРТА:
- Если время в пути пешком (walking) меньше 10 минут - используй walking (пешком)
- Если время в пути пешком больше 10 минут - используй bus (автобус) или car (машина), если доступно
- Всегда сравнивай время в пути для разных видов транспорта и выбирай самый быстрый и удобный вариант
- Учитывай предпочтения пользователя из ограничений, но не следуй им слепо, если это неоптимально

Доступные инструменты:
- get_route_info: получить информацию о маршруте между двумя адресами (ОБЯЗАТЕЛЬНО используй для получения точного времени в пути!)
  Этот инструмент возвращает время в пути для walking, car и bus - сравнивай их и выбирай оптимальный!
- get_weather_by_address: получить погоду по адресу
- search_web: поиск информации в интернете"""

        user_prompt = f"""Создай план похода со следующими событиями:

{events_str}

{constraints_str}

{reasoning_str}

{critique_str}

{weather_info_str if weather_info_str else ""}

{maps_info_str if maps_info_str else ""}

{web_info_str if web_info_str else ""}

Промпт пользователя: {state.input_data.user_prompt}

{route_instruction}

Создай детальный план, который включает все обязательные события и максимально возможное количество других событий с учетом ограничений.
Для каждого события укажи:
- Время начала и окончания
- Режим транспорта (walking, car, bus) - ВЫБИРАЙ ОПТИМАЛЬНЫЙ на основе времени в пути:
  * walking - только если время в пути < 10 минут
  * bus или car - если время в пути пешком > 10 минут (выбирай самый быстрый вариант)
- Время в пути до этого события (в минутах) - ИСПОЛЬЗУЙ ТОЧНЫЕ ДАННЫЕ ИЗ МАРШРУТОВ для выбранного транспорта!

ВАЖНО: При выборе транспорта сравнивай время в пути для всех доступных вариантов (walking, bus, car) и выбирай самый быстрый и удобный!"""

        print("Отправляю запрос к LLM для создания плана...")
        print("💡 LLM может использовать инструменты для получения информации о маршрутах и погоде")
        print("\n📤 Данные, передаваемые в LLM:")
        print(f"   - Событий: {len(state.input_data.events)}")
        if maps_info:
            successful_routes = len([k for k, v in maps_info.items() if v.get("success")])
            print(f"   - Маршрутов в кэше: {successful_routes}/{len(maps_info)}")
        if weather_info:
            successful_weather = len([k for k, v in weather_info.items() if v.get("success")])
            print(f"   - Данных о погоде в кэше: {successful_weather}/{len(weather_info)}")
        if maps_info_str:
            print(f"   - Информация о маршрутах включена в промпт (длина: {len(maps_info_str)} символов)")
        
        plan = self.llm.parse(
            Plan,
            user_prompt=user_prompt,
            system_prompt=system_prompt,
            tools=self.tools
        )
        
        print("✅ План создан:")
        print(f"   - Событий в плане: {len(plan.items)}")
        print(f"   - Общая продолжительность: {plan.total_duration_minutes} минут")
        print(f"   - Время в пути: {plan.total_travel_time_minutes} минут")
        print(f"   - Включено событий: {len(plan.included_events)}")
        if plan.excluded_events:
            print(f"   - Исключено событий: {len(plan.excluded_events)}")
        
        # Возвращаем план (информация о маршрутах и погоде будет собрана LLM через инструменты)
        return plan
    
    def revise_plan(self, state: GraphState):
        """Пересмотреть план на основе критики."""
        print("\n" + "="*60)
        print("🔄 ПЛАНИРОВЩИК: Пересматриваю план на основе критики...")
        print("="*60)
        if state.critique:
            print(f"Учитываю критику: {len(state.critique.suggestions)} предложений, {len(state.critique.critical_issues)} критических проблем")
        # Используем уже собранную информацию из состояния
        return self.create_plan(state)


class CriticAgent:
    """Агент критик."""
    
    def __init__(self, llm: JourneyLLM):
        self.llm = llm
        self.tools = get_all_tools()
        self.llm_with_tools = llm.llm.bind_tools(self.tools)
    
    def critique_plan(self, state: GraphState) -> Critique:
        """Проанализировать план и дать критику."""
        print("\n" + "="*60)
        print("🔍 КРИТИК: Анализирую план...")
        print("="*60)
        
        if not state.plan:
            raise ValueError("Нет плана для критики")
        
        print(f"Анализирую план с {len(state.plan.items)} событиями")
        print(f"Общая продолжительность: {state.plan.total_duration_minutes} минут")
        
        plan_str = f"""
План:
Общая продолжительность: {state.plan.total_duration_minutes} минут
Общее время в пути: {state.plan.total_travel_time_minutes} минут
Краткое описание: {state.plan.summary}

Элементы плана:
"""
        for item in state.plan.items:
            plan_str += f"""
- {item.event_name} ({item.event_address})
  Время: {item.start_time} - {item.end_time}
  Продолжительность: {item.duration_minutes} минут
  Транспорт: {item.transport_mode}
  Время в пути: {item.travel_time_minutes or 'не указано'} минут
  Заметки: {item.notes}
"""
        
        events_str = "\n".join([
            f"- {e.name} ({e.address}, {e.duration_minutes} мин, приоритет: {e.priority}, обязательное: {e.required})"
            for e in state.input_data.events
        ])
        
        constraints_str = f"""
Ограничения:
- Время начала: {state.input_data.constraints.start_time or 'не указано'}
- Время окончания: {state.input_data.constraints.end_time or 'не указано'}
- Максимальное время: {state.input_data.constraints.max_total_time_minutes or 'не указано'} минут
- Предпочтительный транспорт: {state.input_data.constraints.preferred_transport or 'не указано'}
- Бюджет: {state.input_data.constraints.budget or 'не указано'}
- Другие ограничения: {', '.join(state.input_data.constraints.other_constraints) or 'нет'}
"""
        
        weather_info_str = ""
        if state.weather_info:
            weather_info_str = f"\nИнформация о погоде: {state.weather_info}\n"
        
        maps_info_str = ""
        if state.maps_info:
            maps_info_str = f"\nИнформация о маршрутах: {state.maps_info}\n"
        
        system_prompt = """Ты опытный критик планов маршрутов и походов.
Твоя задача - тщательно проанализировать предложенный план, выявить его сильные и слабые стороны,
найти возможные проблемы и предложить конкретные улучшения.

Будь конструктивным, но честным. Укажи как на сильные стороны, так и на проблемы.
Если нужно проверить информацию (например, погоду или маршруты), используй доступные инструменты."""

        user_prompt = f"""Проанализируй следующий план похода:

{plan_str}

Исходные события:
{events_str}

{constraints_str}

{weather_info_str}

{maps_info_str}

Промпт пользователя: {state.input_data.user_prompt}

Оцени план по следующим критериям:
1. Соответствие ограничениям (время, транспорт, бюджет)
2. Реалистичность временных интервалов
3. Логичность последовательности событий
4. Учет всех обязательных событий
5. Оптимальность использования времени
6. Учет погодных условий и других факторов

Дай конструктивную критику с конкретными предложениями по улучшению."""

        print("Отправляю запрос к LLM для анализа плана...")
        print("💡 LLM может использовать инструменты для проверки информации")
        critique = self.llm.parse(
            Critique,
            user_prompt=user_prompt,
            system_prompt=system_prompt,
            tools=self.tools
        )
        
        print("✅ Критика получена:")
        print(f"   - Сильных сторон: {len(critique.strengths)}")
        print(f"   - Слабых сторон: {len(critique.weaknesses)}")
        print(f"   - Предложений: {len(critique.suggestions)}")
        print(f"   - Критических проблем: {len(critique.critical_issues)}")
        print(f"   - Требуется пересмотр: {'Да' if critique.needs_revision else 'Нет'}")
        
        return critique

